main.floors.C52=
{
    "floorId": "C52",
    "title": "珠露原野",
    "name": "珠露原野",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 15,
    "defaultGround": "ground",
    "bgm": "map3.mp3",
    "firstArrive": [
        "本区两个盾的数值与原版不同：左侧盾500，上方盾1250"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "C51",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "0,6": {
            "floorId": "C53",
            "loc": [
                12,
                6
            ],
            "time": 0
        },
        "12,6": {
            "floorId": "C54",
            "loc": [
                0,
                6
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "C55",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "6,6": [
            {
                "type": "function",
                "function": "function(){\ncore.setFlag(\"__visited__\", {});\n}"
            },
            {
                "type": "changeFloor",
                "floorId": "C61",
                "loc": [
                    6,
                    11
                ],
                "direction": "up",
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [153,153,153,153,153,153,353,153,153,153,153,153,153],
    [153, 47,153,454,  0,638, 22,637,  0, 59,153, 50,153],
    [153,631,153,153,153,153,636,153,153,153,153,638,153],
    [153,447,  0,153,  0,453,634, 32,  0,153,  0,453,153],
    [153,  0, 22,637, 58,153,638,153, 28,636,450,  0,153],
    [153,631,153, 81,153,153, 59,153,153, 82,153,631,153],
    [351, 21, 81, 31, 81, 58,645,455, 82,635,480,  0,352],
    [153,600,153,603,153,153, 59,153,153,600,153,603,153],
    [153,636,153,  0, 33,153, 82,153, 27,  0,153, 82,153],
    [153,449,153, 34,  0,634, 22,634,  0, 32,153, 28,153],
    [153,603,153,634,153,153, 81,153,153,603,153, 81,153],
    [153,452,635, 30,602, 86,  0, 86,601, 33,600, 30,153],
    [153,153,153,153,153,153,350,153,153,153,153,153,153]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [],
    "fg2map": [],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}