main.floors.D100=
{
    "floorId": "D100",
    "title": "彩虹城堡",
    "name": "彩虹城堡",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200,
    "defaultGround": 80341,
    "bgm": "map6.mp3",
    "firstArrive": [
        "提示：\n1.通关本区时，等级必须达到578，否则无法进入下区。（打boss也可以升1级）\n2.chaos难度请确保此时有4把绿，若没有可以考虑重打了。",
        {
            "type": "if",
            "condition": "(item:I471===1)",
            "true": [
                "检测到当前为低难度，获得2绿，棕木蝠聚落防御下降",
                {
                    "type": "setEnemy",
                    "id": "E720",
                    "name": "def",
                    "value": "150000"
                },
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "operator": "+=",
                    "value": "2"
                }
            ]
        },
        {
            "type": "if",
            "condition": "(item:I475===1)",
            "true": [
                "检测到当前为低难度，获得1绿，棕木蝠聚落防御下降",
                {
                    "type": "setEnemy",
                    "id": "E720",
                    "name": "def",
                    "value": "175000"
                },
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "operator": "+=",
                    "value": "1"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "D101",
            "loc": [
                6,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [151,151,151,151,151,151,336,151,151,151,151,151,151],
    [151, 22,712, 58,  0,512,711,453,  0,713,  0, 21,151],
    [151,151, 82,151,151,151,714,151,151,151,714,151,151],
    [151,  0,709,  0,711,707,  0,512, 81,838,  0, 22,151],
    [151, 33,  0,448,151,151,709,151,151,  0,452,  0,151],
    [151,151,707,151,151,447,  0, 21,151,151, 82,151,151],
    [151, 59,  0,711,707,  0,436,  0,712,711,  0,436,151],
    [151,151,713,151,151,151, 82,151,151,151,447,151,151],
    [151,448,  0, 30,709, 58,  0, 21,707, 59, 81, 34,151],
    [151,151,716,151,151,151,707,151,151,151, 16,151,151],
    [151, 15, 22, 15,151, 60,  0, 60,151,  0, 16,  0,151],
    [151, 22, 15, 22,151,  0,  0,  0,151, 24,837, 58,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}