main.floors.E2=
{
    "floorId": "E2",
    "title": "沼泽",
    "name": "沼泽",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        [
            0,
            0,
            "03.jpg",
            0
        ]
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "map1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": "E1",
            "loc": [
                6,
                1
            ],
            "direction": "down",
            "time": 0
        }
    },
    "afterBattle": {
        "6,6": [
            {
                "type": "autoSave"
            },
            {
                "type": "choices",
                "text": "自动存档已完成！\n要记录现在的成绩吗？\n记录成绩之后，可以读取自动存档并选择继续游戏。",
                "choices": [
                    {
                        "text": "记录成绩",
                        "action": [
                            {
                                "type": "if",
                                "condition": "item:I474==1",
                                "true": [
                                    {
                                        "type": "win",
                                        "reason": "Rank 3 - Angel"
                                    }
                                ],
                                "false": [
                                    {
                                        "type": "win",
                                        "reason": "Rank 3 - God"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "text": "继续游戏",
                        "action": [
                            {
                                "type": "changeFloor",
                                "floorId": "F1",
                                "loc": [
                                    6,
                                    6
                                ],
                                "direction": "down",
                                "time": 500
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [153,153,153,153,153,153,153,153,153,153,153,153,153],
    [153,450,  0,254,153,153,357,153,153, 81, 81, 58,153],
    [153,153,153, 81,153, 31,  0, 31,153, 32,153,153,153],
    [153,153,447,232,255,  0,512,  0,252, 81, 31,153,153],
    [153,153,153, 81,153,153,228,153,153, 81,153,153,153],
    [153,50002,  0, 21,153, 27,  0,50018,153, 31,  0,50010,153],
    [153, 28,253,  0,254,  0,248,  0, 82,  0,256, 22,153],
    [153,153,  0,255,153, 28,  0, 33,153, 21,  0,153,153],
    [153,153,153,256,153,153,254,153,153,253,153,153,153],
    [153,153,448,250, 81, 28,  0, 21, 86,255, 34,153,153],
    [153,153,153,453,153,  0, 81,  0,153, 27,153,153,153],
    [153,512,513, 82,153,153, 32,153,153,228,512,513,153],
    [153,153,153,153,153,153,153,153,153,153,153,153,153]
],
    "bgmap": [

],
    "fgmap": [

]
}