main.floors.F120=
{
    "floorId": "F120",
    "title": "梦魇深渊",
    "name": "梦魇深渊",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1000,
    "defaultGround": 90654,
    "bgm": "map8.mp3",
    "firstArrive": [
        "1.本区结束以后不会再有匙弱·绿的敌人\n2.横天厉鬼第一次被击败后，属性将大幅降低\n3.现世公国女爵第一次被击败后，属性将大幅降低",
        {
            "type": "if",
            "condition": "(item:I471===1)",
            "true": [
                "检测到当前为低难度，本层和boss层禁制消失",
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            11
                        ]
                    ],
                    "remove": true
                }
            ]
        },
        {
            "type": "if",
            "condition": "(item:I475===1)",
            "true": [
                "检测到当前为低难度，本层禁制消失",
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            11
                        ]
                    ],
                    "remove": true
                }
            ]
        },
        {
            "type": "if",
            "condition": "(item:I845===1)",
            "true": [
                "检测到当前为低难度，获得2红1绿",
                {
                    "type": "setValue",
                    "name": "item:redKey",
                    "operator": "+=",
                    "value": "2"
                },
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "operator": "+=",
                    "value": "1"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "F121",
            "loc": [
                6,
                12
            ]
        },
        "1,11": {
            "floorId": "F121",
            "loc": [
                4,
                8
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [144,144,144,144,144,144,340,144,144,144,144,144,144],
    [144,447,  0,756,500,  0,754, 22,755,453,752,448,144],
    [144,144, 81,144,144,144, 83,144,144,144, 81,144,144],
    [144,  0,753,  0,752,753,  0, 58,755,  0,753,  0,144],
    [144,436,  0,447,144,144, 82,144,144,480,  0, 59,144],
    [144,144,752,144,144,451,  0,447,144,144, 81,144,144],
    [144, 60,  0,450,755,  0,754,  0,752, 81,  0,452,144],
    [144,144,754,144,144,144, 82,144,144,144,753,144,144],
    [144,448,  0,451,753,512,753, 59,  0,448,754,513,144],
    [144,144,754,144,144,144,843,144,144,144,843,144,144],
    [144, 82,436, 81,144, 21,  0, 22,144,502,844,502,144],
    [144,808,760,751,144,  0,  0,  0,144,503,837,503,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}