main.floors.F2=
{
    "floorId": "F2",
    "title": "废墟",
    "name": "废墟",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        [
            0,
            0,
            "04.jpg",
            0
        ]
    ],
    "item_ratio": 1000,
    "defaultGround": "ground",
    "bgm": "map2.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,5": [
            "木牌上写着的字：\n注意啦！百分比加成的装备，\n其能力的计算是基于角色的基础属性，\n即未穿加百分比的装备时的属性。"
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": "F1",
            "loc": [
                6,
                1
            ],
            "direction": "down",
            "time": 0
        }
    },
    "afterBattle": {
        "6,6": [
            {
                "type": "changeFloor",
                "floorId": "G1",
                "loc": [
                    6,
                    6
                ],
                "direction": "down",
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,450,513,303, 20, 20,353, 20, 20, 82,309, 58, 20],
    [ 20, 20, 20, 81, 20, 31,  0, 31, 20, 28, 20, 20, 20],
    [ 20, 20,452, 83,302,  0,513,  0,301, 86, 31, 20, 20],
    [ 20, 20, 20,305, 20, 20,305, 20, 20, 86, 20, 20, 20],
    [ 20,30243,  0, 21, 20, 21,  0,30242, 20,303,  0,30247, 20],
    [ 20,447,307,  0,304,  0,310,  0, 82,  0,306, 22, 20],
    [ 20, 20,  0, 28, 20,449,  0, 33, 20,448,  0, 20, 20],
    [ 20, 20, 20,306, 20, 20,304, 20, 20,305, 20, 20, 20],
    [ 20, 20, 27,308, 81, 28,  0, 21, 81,309, 34, 20, 20],
    [ 20, 20, 20, 34, 20,  0, 81,  0, 20, 28, 20, 20, 20],
    [ 20,448, 81, 81, 20, 20, 34, 20, 20,307, 32,513, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

]
}