main.floors.N2=
{
    "floorId": "N2",
    "title": "冰河",
    "name": "冰河",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        [
            0,
            0,
            "12.jpg",
            0
        ]
    ],
    "item_ratio": 100000000000,
    "defaultGround": "ground",
    "bgm": "map4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": "N1",
            "loc": [
                6,
                1
            ],
            "direction": "down",
            "time": 0
        }
    },
    "afterBattle": {
        "6,6": [
            "当前结局计分：剩余生命/10亿！",
            {
                "type": "setValue",
                "name": "status:hp",
                "value": "status:hp/1000000000"
            },
            {
                "type": "if",
                "condition": "item:I476==1",
                "true": [
                    {
                        "type": "win",
                        "reason": "Rank 12 - Light"
                    }
                ],
                "false": [
                    {
                        "type": "if",
                        "condition": "item:I474==1",
                        "true": [
                            {
                                "type": "win",
                                "reason": "Rank 12 - Angel"
                            }
                        ],
                        "false": [
                            {
                                "type": "win",
                                "reason": "Rank 12 - God"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,447, 22,629,149,149,336,149,149,448,630, 33,149],
    [149,149,149, 34,149, 32,  0, 29,149, 82,149,149,149],
    [149,149, 30,626,624,  0,517,  0,625,623, 31,149,149],
    [149,149,149, 81,149,149,628,149,149,626,149,149,149],
    [149,30587,  0, 30,149, 27,  0,30636,149, 27,  0,30544,149],
    [149,449,627,  0,625,  0,631,  0, 81, 82, 81,516,149],
    [149,149, 21,628,149, 21,  0,449,149, 28,  0,149,149],
    [149,149,149, 86,149,149,626,149,149,625,149,149,149],
    [149,149,517,629,627, 32,  0, 28, 81,627, 34,149,149],
    [149,149,149, 83,149,  0,630,  0,149, 81,149,149,149],
    [149, 59, 83, 58,149,149,447,149,149, 81, 81,450,149],
    [149,149,149,149,149,149,149,149,149,149,149,149,149]
],
    "bgmap": [

],
    "fgmap": [

]
}